Repository: RoyBebru/file-grouper
Catalog: fig/locale/*/LC_MESSAGES/fig.po
Languages: uk

source: Usage format:
uk: Формат виклику:

source: Where <DEST_ROOT_DIR> under '-d'/'--dir' option is the directory to move
uk: Де <DEST_ROOT_DIR> в орції '-d'/'--dir' є базовою текою, куди потраплять

source: categorized files per created assigned subdirectories. The <INSPECTED_DIR>
uk: файли по текам відповідно до категорій. <INSPECTED_DIR> є тією

source: directory must be inspected. Option '-t'/'--types' prints file types per category
uk: текою, що буде проаналізована. Опція '-t'/'--types' виводить розподіл розширень файлів по категоріям

source: subdirectory and exits. Option '-h'/'--help' prints this text. Option '-l'/'--links'
uk: з одноіменними підтеками і виходить. Опція '-h'/'--help' виводить цей текст. Опція '-l'/'--links'

source: serves to making links instead of moving files. Option '-G'/'--no-gui' disable GUI mode.
uk: слугує для створення посилань замість переміщень файлів. Опція '-G'/'--no-gui' забороняє графічний режим роботи.

source: *** Warning: only first option '-d' is applied
uk: *** Попередження: враховується тільки одна опція '-d'

source: *** Error: in option '-d' '%s' must be other than program directory
uk: *** Помилка: в опції '-d' '%s' має бути тека, відмінна від теки програми

source: *** Error: must be only one inspected directory
uk: *** Помилка: має бути тільки одна тека, що аналізується

source: *** Error: '%s' is not valid directory
uk: *** Помилка: '%s' не є правильно вказаною текою

source: *** Error: -d directory ('%s') cannot be
uk: *** Помилка: -d тека ('%s') не може бути

source: (sub-)directory of the inspected directory ('%s')
uk: (під-)текою теки, що аналізується ('%s')

source: *** Warning: wxPython module is not installed
uk: *** Попередження: модуль wxPython не встановлений

source: From
uk: Звідки

source: To
uk: Куди

source: Instead removing do file links
uk: Не переміщати, а робити посилання

source: Ca&tegory Filter... Ctrl-T
uk: Категории... Ctrl-T

source: Edit category list and corresponded extensions
uk: Редаґування відповідності розширень файлів категоріям-текам

source: &Sanity Filter... Ctrl-S
uk: Перетворення символів імен файлів... Ctrl-S

source: Edit filename symbols substitution list
uk: Редаґування тадлиці символьних замін

source: Help
uk: Допомога

source: Show help window
uk: Показати вікно допомоги

source: Author: Dmytro Tarasiuk
uk: Автор: Дмитро Тарасюк

source: Email: RoyBebru@Gmail.Com
uk: Е-пошта: RoyBebru@Gmail.Com

source: Description Of Application
uk: Опис Додатку

source: Does not realized yet.
uk: Ще не зроблено.

source: Choose Directory
uk: Виберіть Теку

source: Folder
uk: Тека

source: is not valid. Try again.
uk: не правильна. Спробуй знову.

source: Select folder to inspect
uk: Виберіть теку для аналізу

source: You see only expectation result: select folder to put it
uk: Ви бачите тільки очікуваний результат: виберіть теку, куди його покласти

source: Press Run button to realize your project in life
uk: Натисніть кнопку запуску, щоб втілити проект в життя

source: Selected folders are not suitable to work
uk: Вибрані теки не сумісні для роботи

source: Apply Changes
uk: Застосувати зміни

source: Insert
uk: Вставити

source: Delete
uk: Видалити

source: Select any category to insert after
uk: Виберіть певну категорію, щоб можна було за нею вставити

source: Link
uk: Посилання

source: will be opened in your standard web browser. Continue?
uk: буде відкрито у вашому стандртному браузері. Продовжити?

source: Confirm
uk: Підтвердити
